000100140218PGM
000101140218 CALL QGPL/STRJOB
000102140218 ADDLIBLE LIB(IBC233LIB)
000103140218 DSPSYSLVL OUTPUT(*DISPLAY)
000104140218ENDPGM
000105140218
