000100140114PGM                                                                             
000200140114  DSPLIBL                                                                       
000300140114  DSPSYSVAL QSYSLIBL                                                            
000400140114  DSPSYSVAL QUSRLIBL                                                            
000500140114  DSPSYSVAL QMODEL                                                              
000600140114ENDPGM                                                                          
