000100121119     FSHIFTRATESIF   E             DISK    RENAME(SHIFTRATES:SHATERATER)
000102121119     FALLSHIFT  IF   E           K DISK    RENAME(ALLSHIFT:ALLSHIFTR)
000103140401     FCONFIRMPA2CF   E             WORKSTN
000104121126     FPAYRPT2   O    E             PRINTER OFLIND(*IN01)
000105121119     DHOURSOVER        S              3  0
000106121126     DMAIN             PR                  EXTPGM('LABPAYROL2')
000107121126     DSHIFTTYPE                      30
000108121126     DMAIN             PI
000109121126     DSHIFTTYPE                      30
000110121119     F/FREE
000111121119       READ SHIFTRATES;
000112121119       WRITE TITLE;
000113121119       WRITE COLHDG;
000114121119       READ ALLSHIFT;
000115121119       DOW NOT %EOF;
000116121119         EXSR PAYSR;
000117121119         IF *IN01;
000118121119           WRITE TITLE;
000119121119           WRITE COLHDG;
000120121126          *IN01=*OFF;
000121121119         ENDIF;
000122121119         WRITE EMPDETAIL;
000123121119         READ ALLSHIFT;
000124121119       ENDDO;
000125121119
000126121126       TOTEMPPAY=TOTREGPAY+TOTOVTPAY;
000127121119       WRITE TOTALS;
000128121126
000129121126       DAYR=DAYRATE;
000130121126       AFTERR=AFTNRATE;
000131121126       NIGHTR=NIGHTRATE;
000132121126       REGPAY=TOTREGPAY;
000133121126       OVTPAY=TOTOVTPAY;
000134121126       COMPAY=TOTEMPPAY;
000135121126
000136121126       EXFMT RECORD1;
000137121119       *INLR = *ON;
000138121119       RETURN;
000139121119       BEGSR PAYSR;
000140121119         SELECT;
000141121123           WHEN WORKSHIFT='D';
000142121123             HOURLYRATE=DAYRATE;
000143121123           WHEN WORKSHIFT='N';
000144121123             HOURLYRATE=NIGHTRATE;
000145121123           WHEN WORKSHIFT='A';
000146121123             HOURLYRATE=AFTNRATE;
000147121123
000148121119         ENDSL;
000149121123         SELECT;
000150121123           WHEN PAYGRADE='1';
000151121126             EVAL(H) HOURLYRATE=HOURLYRATE*1.085;
000152121123           WHEN PAYGRADE='2';
000153121126             EVAL(H) HOURLYRATE=HOURLYRATE*1.045;
000154121123           WHEN PAYGRADE='3';
000155121126             EVAL(H) HOURLYRATE=HOURLYRATE*.95;
000156121123         ENDSL;
000157121126
000158121126         IF HRSWORKED >=41;
000159121126            EVAL(H) REGULARPAY=40*HOURLYRATE;
000160121126            EVAL(H) OVERPAY=(HRSWORKED-40)*(HOURLYRATE*1.5);
000161121126
000162121126         ENDIF;
000163121126         IF HRSWORKED<=40;
000164121126           EVAL(H) REGULARPAY=HRSWORKED*HOURLYRATE;
000165121126           OVERPAY=0;
000166121126         ENDIF;
000167121126         TOTALPAY=REGULARPAY+OVERPAY;
000168121126         TOTREGPAY=TOTREGPAY+REGULARPAY;
000169121126         TOTOVTPAY=TOTOVTPAY+OVERPAY;
000170121126
000171121126
000172121126
000173121119       ENDSR;
000174121119
000175121119
000176121119
000177121119
000178121119
000179121119
000180121119
000181121119
000182121119
000183121119
000184121119
000185121119
000186121119
