000100140126     FMARKSDSP  CF   E             WORKSTN
000101140126      /FREE
000102140126           EXFMT RECORD1;
000103140126                  DOW NOT(*IN03);
000104140126                    EXSR GETGRADE;
000105140203                    *IN40 = *ON;
000106140126                    WRITE RECORD1;
000107140126                    EXFMT RECORD2;
000108140203                    *IN40 = *OFF;
000109140126                    IF *IN03 = *OFF;
000110140126                      EXSR CLEARMARKS;
000111140126                      EXFMT RECORD1;
000112140126                    ENDIF;
000113140126                  ENDDO;
000114140126               *INLR = *ON;
000115140126               RETURN;
000116140126           BEGSR GETGRADE;
000117140126             TESTOVRALL =(TEST1+TEST2+TEST3)/3;
000118140128             NUMGRADE = ((LABS/30)*30)+((TESTOVRALL/100)*35)+((EXAM/100)*35);
000119140126             SELECT;
000120140126               WHEN NUMGRADE > 89;
000121140126                 LETGRADE = 'A+';
000122140126               WHEN NUMGRADE > 79;
000123140126                 LETGRADE = 'A';
000124140126               WHEN NUMGRADE > 74;
000125140126                 LETGRADE = 'B+';
000126140126               WHEN NUMGRADE > 70;
000127140126                 LETGRADE = 'B';
000128140126               WHEN NUMGRADE > 64;
000129140126                 LETGRADE = 'C+';
000130140126               WHEN NUMGRADE > 59;
000131140204                 LETGRADE = 'C';
000132140126               WHEN NUMGRADE > 54;
000134140204                 LETGRADE = 'D+';
000135140204               WHEN NUMGRADE >49;
000136140204                 LETGRADE = 'D';
000137140204               WHEN NUMGRADE < 49;
000138140126                 LETGRADE = 'F';
000139140126             ENDSL;
000140140126           ENDSR;
000141140126           BEGSR CLEARMARKS;
000142140126             TEST1=0;
000143140126             TEST2=0;
000144140126             TEST3=0;
000145140126             LABS=0;
000146140126             EXAM=0;
000147140126           ENDSR;
