000100120314     FMARKSDSP  CF   E             WORKSTN
000102120314      /FREE
000103120314       EXFMT RECORD1;
000105120314       DOW NOT(*IN03);
000107120314           EXSR GETGRADE;
000109120314           WRITE RECORD1;
000111120314           EXFMT RECORD2;
000113120314           IF *IN03=*OFF;
000115120314               EXSR CLEARMARKS;
000117120314               EXFMT RECORD1;
000119120314           ENDIF;
000121120314       ENDDO;
000123120314       *INLR=*ON;
000125120314       RETURN;
000127120314       BEGSR GETGRADE;
000129120314           NUMGRADE = (LABS/30)*30 + ((TEST1+TEST2+TEST3)/300)*35 +  EXAM/100*35;
000130120314           TESTOVRALL = (TEST1 + TEST2 + TEST3)/3;
000133120314           SELECT;
000134120314           When NUMGRADE >= 90;
000135120314               LETGRADE = 'A+';
000136120314           When NUMGRADE >= 80;
000137120314               LETGRADE = 'A';
000138120314           When NUMGRADE >= 75;
000139120314               LETGRADE = 'B+';
000140120314           When NUMGRADE >= 70;
000141120314               LETGRADE = 'B';
000142120314           When NUMGRADE >= 65;
000143120314               LETGRADE = 'C+';
000144120314           When NUMGRADE >= 60;
000145120314               LETGRADE = 'C';
000146120314           When NUMGRADE >= 55;
000147120314               LETGRADE = 'D+';
000148120314           When NUMGRADE >= 0;
000149120314               LETGRADE = 'F';
000150120314           ENDSL;
000169120314       ENDSR;
000171120314       BEGSR CLEARMARKS;
000180120314          TEST1 = 0;
000181120314          TEST2 = 0;
000182120314          TEST3 = 0;
000183120314          LABS = 0;
000184120314          EXAM = 0;
000185120314       ENDSR;
