000100140304     FMARKSDSP2 CF   E             WORKSTN
000102120306
000103120306      /FREE
000104120307            *IN50 = *OFF;
000105120307            EXFMT RECORD1;
000106120307            PASS = 0;
000107120306            FAIL = 0;
000108120306            QUERIES = 0;
000109120306            AVERAGE = 0;
000110120306                  DOW NOT(*IN03);
000112120131                       EXSR GETGRADE;
000113120131                       WRITE RECORD1;
000114120306                       *IN31 = *OFF;
000115120306                       *IN32 = *OFF;
000116120306                       *IN33 = *OFF;
000117120307                       *IN50 = *OFF;
000118140311                       *IN51 = *OFF;
000119120307                       EXFMT RECORD2;
000120120307                       *IN40 = *OFF;
000121120307                       AVERAGE = AVERAGE * QUERIES;
000122120307                       QUERIES = QUERIES + 1;
000123120307                       AVERAGE = (AVERAGE + NUMGRADE)/QUERIES;
000124120131                       IF *IN03 = *OFF;
000125120131                               EXSR CLEARMARKS;
000126120307                               EXFMT RECORD1;
000127120307                       ENDIF;
000129120306                       IF *IN03 = *ON;
000130140310                           EXSR CLEARMARKS;
000131120306                           EXFMT RECORD3;
000132120307                           RETURN;
000133120306                       ENDIF;
000134120131                  ENDDO;
000135120131            *INLR = *ON;
000136120131            RETURN;
000137120131       BEGSR GETGRADE;
000138120307       *IN50 = *ON;
000139120307          NUMGRADE = (LABS/30)*30 + ((TEST1+TEST2+TEST3)/300)*35 +  EXAM/100*35;
000140120307          TESTOVRALL = (TEST1 + TEST2 + TEST3)/3;
000141120307          IF TEST1 < TEST2 AND TEST1 < TEST3;
000142120306            *IN31 = *ON;
000143120306             TESTOVRALL = (TEST2 + TEST3)/2;
000144120306          ENDIF;
000145120307          IF TEST2 < TEST1 AND TEST2 < TEST3 ;
000146120306            *IN32 = *ON;
000147120306             TESTOVRALL = (TEST1 + TEST3)/2;
000148120306          ENDIF;
000149120307          IF TEST3 < TEST1 AND TEST3 < TEST2 ;
000150120306            *IN33 = *ON;
000151120306             TESTOVRALL = (TEST1 + TEST2)/2;
000152120306          ENDIF;
000153120307          IF TEST1 = TEST2 AND *IN33 = *OFF;
000154120306             *IN31 = *ON;
000155120306             TESTOVRALL = (TEST2 + TEST3)/2;
000156120306          ENDIF;
000157120307          IF TEST1 = TEST3 AND *IN32 = *OFF;
000158120306             *IN31 = *ON;
000159120306             TESTOVRALL = (TEST2 + TEST3)/2;
000160120306          ENDIF;
000161120307          IF TEST3 = TEST2 AND *IN31 = *OFF;
000162120306             *IN32 = *ON;
000163120306             TESTOVRALL = (TEST1 + TEST3)/2;
000164120306          ENDIF;
000165120306
000166120131          SELECT;
000167120306          When NUMGRADE >= 90;
000168120131                LETGRADE = 'A+';
000169120131          When NUMGRADE >= 80;
000170120131                LETGRADE = 'A';
000171120131          When NUMGRADE >= 75;
000172120131                LETGRADE = 'B+';
000173120131          When NUMGRADE >= 70;
000174120131                LETGRADE = 'B';
000175120131          When NUMGRADE >= 65;
000176120131                LETGRADE = 'C+';
000177120131          When NUMGRADE >= 60;
000178120131                LETGRADE = 'C';
000179120131          When NUMGRADE >= 55;
000180120131                LETGRADE = 'D+';
000181140311          WHEN NUMGRADE >=50;
000182140311                LETGRADE = 'D';
000183140311          When NUMGRADE < 49;
000184120131                LETGRADE = 'F';
000185120131          ENDSL;
000186120306
000187140311          IF EXAM < 55 AND TESTOVRALL > 55;
000188140311             *IN51 = *ON;
000189140311             LETGRADE = 'F';
000190140311             FAIL = FAIL+1;
000191140311          ENDIF;
000192140311
000193120306          IF TESTOVRALL < 55;
000194120306            *IN40 = *ON;
000195120306            LETGRADE = 'F';
000196120307            FAIL = FAIL + 1;
000197120306          ENDIF;
000198140311          IF TESTOVRALL >= 55 AND EXAM >= 55;
000199120307            PASS = PASS + 1;
000200120307          ENDIF;
000201120307       ENDSR;
000202120131
000203120131       BEGSR CLEARMARKS;
000204120131          TEST1 = 0;
000205120131          TEST2 = 0;
000206120131          TEST3 = 0;
000207120131          LABS = 0;
000208120131          EXAM = 0;
000209120131       ENDSR;
000210120131
000211120131
