000100120314     A          R RECORD1
000101120314     A                                  1 71DATE
000103120314     A                                  2 71TIME
000105120314     A                                  1 34'Marks Calculator'
000107120314     A                                  3 22'Test 1:'
000109120314     A                                  4 22'Test 2:'
000111120314     A                                  5 22'Test 3:'
000113120314     A                                  6 22'Labs:'
000115120314     A                                  7 22'Exam:'
000116120314     A            TEST1          3  0B  3 30RANGE(0 100)
000123120314     A            TEST2          3  0B  4 30RANGE(0 100)
000125120314     A            TEST3          3  0B  5 30RANGE(0 100)
000127120314     A            LABS           2  0B  6 30RANGE(0 30)
000129120314     A            EXAM           3  0B  7 30RANGE(0 100)
000130120314     A                                  2  4SYSNAME
000131120314     A                                  1  4USER
000132120314     A          R RECORD2                   CA03(03 'Exit')
000133120314     A                                      OVERLAY
000135120314     A                                  9 22'Tests:'
000137120314     A                                 11 17'Final Mark:'
000139120314     A                                 13 16'Final Grade:'
000141120314     A                                 15 19'F3- Exit'
000143120314     A            TESTOVRALL     3  0O  9 30
000145120314     A            NUMGRADE       3  0O 11 30
000147120314     A            LETGRADE       2   O 13 30
000148120314
